/*
 Copyright 2009-2010 Urban Airship Inc. All rights reserved.
 
 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions are met:
 
 1. Redistributions of source code must retain the above copyright notice, this
 list of conditions and the following disclaimer.
 
 2. Redistributions in binaryform must reproduce the above copyright notice,
 this list of conditions and the following disclaimer in the documentation 
 and/or other materials provided withthe distribution.
 
 THIS SOFTWARE IS PROVIDED BY THE URBAN AIRSHIP INC ``AS IS'' AND ANY EXPRESS OR
 IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO
 EVENT SHALL URBAN AIRSHIP INC OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
 INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
 DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
 OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
 ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
"UA_Ooopsie" = "Ooopsie";
"UA_App_Key_not_set" = "Application KEY and/or SECRET not set, please insert your application key from http://go.urbanairship.com into the Airship initialization located in your App Delegate's didFinishLaunching method";

"UA_Update" = "Update";
"UA_Content" = "Content";
"UA_Restore" = "Restore";

"UA_Details" = "Details";
"UA_Loading" = "Loading...";
"UA_Free" = "FREE";

"UA_Clear" = "Clear";
"UA_Buy" = "Buy";
"UA_OK" = "OK";
"UA_Cancel" = "Cancel";
"UA_Yes" = "Yes";
"UA_No" = "No";
"UA_No_Content" = "No Content";
"UA_Download" = "Download";

/* Status messages */
"UA_Status_Apple" = "Retrieving pricing information.";
"UA_Status_Failed" = "Failed to contact server. Please check your network connection, and try again.";
"UA_Status_Disabled" = "Purchases disabled. Please re-enable via the Settings application, and try again.";
"UA_Status_Downloading" = "Loading...";

/* UIAlerts */
"UA_purchase_error_title" = "In-App-Purchase Error";
"UA_purchase_error" = "There was an error purchasing this item. Please try again.";

"UA_download_content_failure_title" = "Download Error";
"UA_download_content_failure" = "Failure downloading content. Please try again.";

"UA_receipt_verification_failure_title" = "Purchase Error";
"UA_receipt_verification_failure" = "Failure verifying receipt. Please try again.";

"UA_decompress_failure_title" = "Installation Error";
"UA_decompress_failure" = "Failure decompressing content.";

"UA_content_restore_title" = "Restore Content";
"UA_content_restore" = "%d %@ available for restore. Would you like to download %@ now?";
"UA_content_restore_none" = "There were no purchases to restore.";
"UA_content_restore_question" = "Would you like to check for and restore any previous purchases?";

"UA_item" = "item";
"UA_item_plural" = "items"; 
"UA_it" = "it";
"UA_them" = "them";

"UA_Irreversible" = "Irreversible";
"UA_Clear_History_Warning" = "Clear history permanently?";

"UA_installed" = "INSTALLED";
"UA_update_available" = "UPDATE";
"UA_not_downloaded" = "DOWNLOAD";
"UA_downloading" = "DOWNLOADING";
"UA_update_all" = "Update All";


"UA_filter_all" = "All";
"UA_filter_installed" = "Installed";
"UA_filter_updates" = "Updates";
